<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5f0bd0fb47201563c7eb6cd874d56285c39936abbf0b2d1fdd1f57ceea928114","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1341 at https://github.com/cal-itp/data-infra/actions/runs/20941999630","plan_out_hash":"1ffa09b4679c6048c79ffe26bac8a3bdbecde85af20238ba94cf1f4a47427d07","plan_hash":"bf6de6dd90b86f48a10b800af51c8bc8b32c8689961b1d6a53a90d622f46ed33","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T3iT2Q==" -> (known after apply)
!~      detect_md5hash      = "/Aq78xQsxixaNhFLi7lerA==" -> "different hash"
!~      generation          = 1767986275211319 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "/Aq78xQsxixaNhFLi7lerA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/incremental_max_date.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "e2naWg==" -> (known after apply)
!~      detect_md5hash      = "JqXMx5Nc+iYhkLYaNC/1Sw==" -> "different hash"
!~      generation          = 1754523275792656 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/incremental_max_date.sql"
!~      md5hash             = "JqXMx5Nc+iYhkLYaNC/1Sw==" -> (known after apply)
        name                = "data/warehouse/macros/incremental_max_date.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/incremental_where.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "IgJD3Q==" -> (known after apply)
!~      detect_md5hash      = "k6BxXYmdWDTk/x+0KxH2vA==" -> "different hash"
!~      generation          = 1749663115499144 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/incremental_where.sql"
!~      md5hash             = "k6BxXYmdWDTk/x+0KxH2vA==" -> (known after apply)
        name                = "data/warehouse/macros/incremental_where.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1gAzsg==" -> (known after apply)
!~      detect_md5hash      = "7E7UGupuXzQYe6ENd8jzdg==" -> "different hash"
!~      generation          = 1767986275850384 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "7E7UGupuXzQYe6ENd8jzdg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1341](https://github.com/cal-itp/data-infra/actions/runs/20941999630)